def smooth5(x, pow):
    """
    用途：输入数据x，对该数据用相邻的5个点进行平滑
    参数说明：
        x - 输入数据
        y - 输出数据
        pow=2时，五点二次平滑方法
        pow=3时，五点三次平滑方法
    """
    import numpy as np
    N = len(x)
    y = np.zeros(N)
    if pow == 2:
        y[0] = (31 * x[0] + 9 * x[1] - 3 * x[2] - 5 * x[3] + 3 * x[4]) / 35
        y[1] = (9 * x[0] + 13 * x[1] + 12 * x[2] + 6 * x[3] - 5 * x[4]) / 35
        for k in range(2, N-2):
            y[k] = (-3 * x[k-2] + 12 * x[k-1] + 17 * x[k] + 12 * x[k+1] - 3 * x[k+2]) / 35
        y[-2] = (-5 * x[-5] + 6 * x[-4] + 12 * x[-3] + 13 * x[-2] + 9 * x[-1]) / 35
        y[-1] = (3 * x[-5] - 5 * x[-4] - 3 * x[-3] + 9 * x[-2] + 31 * x[-1]) / 35
    elif pow == 3:
        y[0] = (69 * x[0] + 4 * x[1] - 6 * x[2] + 4 * x[3] - x[4]) / 70
        y[1] = (2 * x[0] + 27 * x[1] + 12 * x[2] - 8 * x[3] + 2 * x[4]) / 35
        for k in range(2, N-2):
            y[k] = (-3 * x[k-2] + 12 * x[k-1] + 17 * x[k] + 12 * x[k+1] - 3 * x[k+2]) / 35
        y[-2] = (2 * x[-5] - 8 * x[-4] + 12 * x[-3] + 27 * x[-2] + 2 * x[-1]) / 35
        y[-1] = (-x[-5] + 4 * x[-4] - 6 * x[-3] + 4 * x[-2] + 69 * x[-1]) / 70
    else:
        raise ValueError("Error:该函数的平滑方法只有2次和3次！")
    return y
